-- -*- M2-comint -*- {* hash: 1876139820 *}
--loading configuration for package "FourTiTwo" from file /Users/maclagan/Library/Application Support/Macaulay2/init-FourTiTwo.m2
--loading configuration for package "gfanInterface2" from file /Users/maclagan/Library/Application Support/Macaulay2/init-gfanInterface2.m2
--loading configuration for package "Tropical" from file /Users/maclagan/Library/Application Support/Macaulay2/init-Tropical.m2
-- polymake not present

i1 : QQ[x,y];

i2 : I=ideal(x+y+1);

o2 : Ideal of QQ[x, y]

i3 : T=tropicalVariety(I)

o3 = T

o3 : TropicalCycle

i4 : rays(T)

o4 = | 1 -1 0 |
     | 0 -1 1 |

              2        3
o4 : Matrix ZZ  <--- ZZ

i5 : maxCones(T)

o5 = {{1}, {0}, {2}}

o5 : List

i6 : linealitySpace T

o6 = 0

              2
o6 : Matrix ZZ  <--- 0

i7 : fVector fan T

o7 = {1, 3}

o7 : List

i8 : QQ[x,y,z,w];

i9 : I=intersect(ideal(x+y+z+w),ideal(x-y,y-z));

o9 : Ideal of QQ[x, y, z, w]

i10 : T= tropicalVariety(I,Prime=>false);

i11 : rays(T)

o11 = | 1  3  1  -1 1  -1 -1 -1 |
      | 1  -1 1  3  -1 1  -1 -1 |
      | 1  -1 -1 -1 1  1  3  -1 |
      | -3 -1 -1 -1 -1 -1 -1 3  |

               4        8
o11 : Matrix ZZ  <--- ZZ

i12 : maxCones(T)

o12 = {{0}, {1, 2}, {1, 4}, {1, 7}, {2, 3}, {4, 6}, {3, 5}, {3, 7}, {5, 6},
      -----------------------------------------------------------------------
      {6, 7}}

o12 : List

i13 : multiplicities(T)

o13 = {1, 1, 1, 1, 1, 1, 1, 1, 1, 1}

o13 : List

i14 : linealitySpace T

o14 = | 1 |
      | 1 |
      | 1 |
      | 1 |

               4        1
o14 : Matrix ZZ  <--- ZZ

i15 : 
